Basic Jmeter _Load Test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Reggie SmokeTest" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables - Environment" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="ports" elementType="Argument">
            <stringProp name="Argument.name">ports</stringProp>
            <stringProp name="Argument.value">http</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="domain" elementType="Argument">
            <stringProp name="Argument.name">domain</stringProp>
            <stringProp name="Argument.value">www.google.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup guiclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroupGui" testclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup" testname="bzm - Concurrency Thread Group -- google com load test" enabled="true">
        <elementProp name="ThreadGroup.main_controller" elementType="com.blazemeter.jmeter.control.VirtualUserController"/>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="TargetLevel">10</stringProp>
        <stringProp name="RampUp">10</stringProp>
        <stringProp name="Steps">5</stringProp>
        <stringProp name="Hold">1</stringProp>
        <stringProp name="Unit">S</stringProp>
      </com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Http Request - Google.com Load Test" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${domain}</stringProp>
          <stringProp name="HTTPSampler.protocol">${ports}</stringProp>
          <stringProp name="HTTPSampler.path">/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/xml</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">text/xml</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept-Encoding</stringProp>
                <stringProp name="Header.value">GZIP</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Error does not exist in Response" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-500154734">&lt;Error&gt;</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">20</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
            <boolProp name="com.blazemeter.jmeter.debugger.engine.Debugger">true</boolProp>
          </ResponseAssertion>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="RefactorJacketID" enabled="false">
            <stringProp name="RegexExtractor.useHeaders">false</stringProp>
            <stringProp name="RegexExtractor.refname">RefactorJacketID</stringProp>
            <stringProp name="RegexExtractor.regex">([0-9]*?)(?=&lt;\/JacketNumber&gt;)</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
            <stringProp name="RegexExtractor.default">Null</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
            <boolProp name="com.blazemeter.jmeter.debugger.engine.Debugger">true</boolProp>
          </RegexExtractor>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="RefactorReggieId" enabled="false">
            <stringProp name="RegexExtractor.useHeaders">false</stringProp>
            <stringProp name="RegexExtractor.refname">RefactorReggieId</stringProp>
            <stringProp name="RegexExtractor.regex">([0-9]*?)(?=&lt;\/ReggieId&gt;)</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
            <stringProp name="RegexExtractor.default">Null</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
            <boolProp name="com.blazemeter.jmeter.debugger.engine.Debugger">true</boolProp>
          </RegexExtractor>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="RefactorReggieResponse" enabled="false">
            <stringProp name="RegexExtractor.useHeaders">false</stringProp>
            <stringProp name="RegexExtractor.refname">RefactorReggieResponse</stringProp>
            <stringProp name="RegexExtractor.regex">(.*)</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
            <stringProp name="RegexExtractor.default">Null</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
            <boolProp name="com.blazemeter.jmeter.debugger.engine.Debugger">true</boolProp>
          </RegexExtractor>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="JSR223 Assertion" enabled="false">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">/*
log.info &quot;&lt;JacketNumber&gt;&quot;+vars[&apos;RefactorJacketID&apos;]+&quot;&lt;/JacketNumber&gt;&quot;
log.info &quot;&lt;ReggieId&gt;&quot;+vars[&apos;RefactorReggieId&apos;]+&quot;&lt;/ReggieId&gt;&quot;

log.info &quot;&lt;JacketNumber&gt;&quot;+vars[&apos;currentJacketID&apos;]+&quot;&lt;/JacketNumber&gt;&quot;
log.info &quot;&lt;ReggieId&gt;&quot;+vars[&apos;currentReggieId&apos;]+&quot;&lt;/ReggieId&gt;&quot;
*/
String refactorresponse = vars[&apos;RefactorReggieResponse&apos;].replace(&quot;&lt;JacketNumber&gt;&quot;+vars[&apos;RefactorJacketID&apos;]+&quot;&lt;/JacketNumber&gt;&quot;,&quot;&quot;)
refactorresponse = refactorresponse.replace(&quot;&lt;ReggieId&gt;&quot;+vars[&apos;RefactorReggieId&apos;]+&quot;&lt;/ReggieId&gt;&quot;,&quot;&quot;)
refactorresponse = refactorresponse.replace(vars[&apos;refactorresponseReplaceString&apos;],&quot;&quot;)

String currentresponse = vars[&apos;CurrentReggieResponse&apos;].replace(&quot;&lt;JacketNumber&gt;&quot;+vars[&apos;currentJacketID&apos;]+&quot;&lt;/JacketNumber&gt;&quot;,&quot;&quot;)
currentresponse  = currentresponse.replace(&quot;&lt;ReggieId&gt;&quot;+vars[&apos;currentReggieId&apos;]+&quot;&lt;/ReggieId&gt;&quot;,&quot;&quot;)
currentresponse  = currentresponse.replace(vars[&apos;currentresponseReplaceString&apos;],&quot;&quot;)
/*
log.info refactorresponse 
log.info currentresponse 
*/
if(refactorresponse == currentresponse){
	log.warn &apos;Current and Refactor - response are equal&apos;
} else {
	log.error &apos;Current and Refactor - response are not equal&apos;
	AssertionResult.setFailureMessage(&quot;Current and Refactor - response are not equal&quot;);
     AssertionResult.setFailure(true); 
}


</stringProp>
          </JSR223Assertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">${ResultFile}</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>